---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralWallUsageFilter
source: html/de860e18-edea-1d67-68e6-159f8db23a95.htm
---
# StructuralWallUsageFilter Members

Constructs a new instance of a filter to match walls that have the given structural wall usage.